### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

## Player Count

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [2]:
purchase_sn = purchase_data["SN"].value_counts()
purchase_sn

Lisosia93        5
Idastidru52      4
Iral74           4
Lisopela58       3
Umolrian85       3
                ..
Phiarithdeu40    1
Undotesta33      1
Yadanu52         1
Indirrian56      1
Sondistanya61    1
Name: SN, Length: 576, dtype: int64

In [3]:
purchase_sn_len = len(purchase_sn)
purchase_sn_len

576

* Display the total number of players

In [4]:
player_count = pd.DataFrame({"Total Players": [purchase_sn_len],})
player_count

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
#number of unique items
unique_items = purchase_data["Item ID"].nunique()

#average price
avg_price = purchase_data["Price"].mean()

#number of purchases
num_of_purchases = purchase_data["Price"].count()

#total revenue
tot_revenue = purchase_data["Price"].sum()

In [6]:
unique_items

179

In [7]:
avg_price

3.050987179487176

In [8]:
num_of_purchases

780

In [9]:
tot_revenue

2379.77

In [10]:
#New DF
summary_dataframe = pd.DataFrame(
    {"Number of Unique Items": [unique_items],
     "Average Price": [avg_price],
     "Number of Purchases": [num_of_purchases],
     "Total Revenue": [tot_revenue]
     }
)
summary_dataframe

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [11]:
#Clean formatting
summary_dataframe.style.format({'Average Price':"${:,.2f}",
                         'Total Revenue': '${:,.2f}'})

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [12]:
total_players = purchase_sn_len
total_players

576

In [13]:
gender_demographics = purchase_data.loc[:, ["Gender", "SN", "Age"]]
gender_demographics.head()

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [14]:
gender_demographics = gender_demographics.drop_duplicates()

player_count = gender_demographics.count()[0]
player_count

576

In [15]:
#Categories of All Players
cat_all_players = gender_demographics["Gender"].value_counts()
cat_all_players

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [16]:
#Percentage of All Players
percentage_of_players = cat_all_players / total_players *100
percentage_of_players

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [17]:
#Summary DF
gender_demo_summary = pd.DataFrame(
    {"Total Count": cat_all_players,
     "Percentage of Players": percentage_of_players
     }
)
gender_demo_summary

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [18]:
#Clean DF
gender_demo_summary = gender_demo_summary.round(2)

gender_demo_summary

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [19]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [20]:
#group by gener
gen_pur = purchase_data.groupby(['Gender'])
gen_pur

#purchase count by gender
purchase_count = gen_pur["Purchase ID"].count()
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [21]:
#average purchase price by gender
purchase_price = gen_pur["Price"].mean()
purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [22]:
#total purchase value by gender
total_purchase_value = gen_pur["Price"].sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [23]:
tot_count_gender = gen_pur.nunique()["SN"]
tot_count_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [24]:
#avg total purchase per person by gender
average_total_purchase_pr_person = total_purchase_value / tot_count_gender
average_total_purchase_pr_person

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [25]:
# New DF
purchasing_analysis_gender = pd.DataFrame(
                            {"Purchase Count": purchase_count, 
                            "Average Purchase Price": purchase_price,
                            "Total Purchase Value":total_purchase_value,
                            "Avg Total Purchase per Person": average_total_purchase_pr_person})
purchasing_analysis_gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [26]:
# set indec
purchasing_analysis_gender.index.name = "Gender"
purchasing_analysis_gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [27]:
# clean df
purchasing_analysis_gender.style.format({"Average Purchase Price":"${:,.2f}",
                                  "Total Purchase Value":"${:,.2f}",
                                  "Avg Total Purchase per Person":"${:,.2f}"})

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [28]:
#Bins
age_demo_bins = [0, 9.90, 14.90, 19.90, 24.9, 29.9, 34.90, 39.90, 9999999]
group_lbl_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", ">40"]

In [29]:
#cut into bins
gender_demographics["Age Ranges"] = pd.cut(gender_demographics["Age"], age_demo_bins, labels=group_lbl_names)
gender_demographics.head()

  Gender             SN  Age Age Ranges
0   Male        Lisim78   20      20-24
1   Male    Lisovynya38   40        >40
2   Male     Ithergue48   24      20-24
3   Male  Chamassasya86   24      20-24
4   Male      Iskosia90   23      20-24

In [30]:
#percentages
age_demo_totals = gender_demographics["Age Ranges"].value_counts()
age_demo_totals

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
>40       12
Name: Age Ranges, dtype: int64

In [31]:
#by age group
age_demo_percents = age_demo_totals / total_players * 100
age_demo_percents

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
>40       2.083333
Name: Age Ranges, dtype: float64

In [32]:
#simmary df
age_demo_summary = pd.DataFrame(
                    {"Total Count": age_demo_totals, 
                     "Percentage of Players": age_demo_percents})
age_demo_summary

       Total Count  Percentage of Players
20-24          258              44.791667
15-19          107              18.576389
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
10-14           22               3.819444
<10             17               2.951389
>40             12               2.083333

In [33]:
#Sort
age_demo_summary = age_demo_summary.sort_index()
age_demo_summary

       Total Count  Percentage of Players
<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
>40             12               2.083333

In [34]:
#clean df

age_demo_summary = age_demo_summary.round(2)
age_demo_summary

       Total Count  Percentage of Players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
>40             12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [35]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [36]:
#cut
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], age_demo_bins, labels=group_lbl_names)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,>40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [37]:
#Bin
groupby_age = purchase_data.groupby("Age Ranges")
groupby_age

In [38]:
#paa -purchasing analysis age
purchase_count_paa = groupby_age["Purchase ID"].count()
purchase_count_paa

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
>40       13
Name: Purchase ID, dtype: int64

In [39]:
#avg. purchase price
average_purchase_price_paa = groupby_age["Price"].mean()
average_purchase_price_paa

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
>40      2.941538
Name: Price, dtype: float64

In [40]:
#total purchase value
total_purchase_value_paa = groupby_age["Price"].sum()
total_purchase_value_paa

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
>40        38.24
Name: Price, dtype: float64

In [63]:
#total players by age category
total_count_ages = groupby_age["SN"].nunique()

In [64]:
#avg. purchase total per person
avg_purchase_per_person_paa = total_purchase_value_paa/total_count_ages
avg_purchase_per_person_paa

Age Ranges
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
>40      3.186667
dtype: float64

In [65]:
#New DF
pa_age_demographics = pd.DataFrame({"Purchase Count": purchase_count_paa,
                                 "Average Purchase Price": average_purchase_price_paa,
                                 "Total Purchase Value":total_purchase_value_paa,
                                 "Average Purchase Total per Person": avg_purchase_per_person_paa})

pa_age_demographics

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
>40,13,2.941538,38.24,3.186667

In [66]:
#Clean df
pa_age_demographics.index.name = None

pa_age_demographics.style.format({"Average Purchase Price":"${:,.2f}",
                               "Total Purchase Value":"${:,.2f}",
                               "Average Purchase Total per Person":"${:,.2f}"})

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [45]:
# Groupby
top_senders = purchase_data.groupby("SN")
top_senders

In [46]:
#Purchase Count ts-top senders
purchase_count_ts = top_senders["Purchase ID"].count()
purchase_count_ts

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [47]:
#avg. purchase price ts-top senders
avg_purchase_price_ts = top_senders["Price"].mean()
avg_purchase_price_ts

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [48]:
#total purchase value ts-top senders
total_purchase_value_ts = top_senders["Price"].sum()
total_purchase_value_ts

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [49]:
# New Df
top_spenders_summary = pd.DataFrame({"Purchase Count": purchase_count_ts,
                                     "Average Purchase Price": avg_purchase_price_ts,
                                     "Total Purchase Value":total_purchase_value_ts}
                                   )    
top_spenders_summary.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [50]:
# Sort
top_spenders_sum_format = top_spenders_summary.sort_values(["Total Purchase Value"], ascending=False).head()
top_spenders_sum_format

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [51]:
# Clean
top_spenders_sum_format.style.format({"Average Purchase Total":"${:,.2f}",
                                     "Average Purchase Price":"${:,.2f}", 
                                     "Total Purchase Value":"${:,.2f}"})

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [52]:
all_items = purchase_data[["Item ID", "Item Name", "Price"]]
all_items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [53]:
#Group by 
all_items_groupby = all_items.groupby(["Item ID","Item Name"])
all_items_groupby

In [54]:
#mpi-most popular items
purchase_count_mpi = all_items_groupby["Price"].count()
purchase_count_mpi

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [55]:
#total purchase value 
#mpi-most popular items
total_purchase_value_mpi = (all_items_groupby["Price"].sum()) 
total_purchase_value_mpi

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [56]:
#item price
#mpi-most popular items
item_price_mpi = total_purchase_value_mpi/purchase_count_mpi
item_price_mpi

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [57]:
#New DF
most_popular_items_summary = pd.DataFrame({"Purchase Count": purchase_count_mpi, 
                                           "Item Price": item_price_mpi,
                                           "Total Purchase Value":total_purchase_value_mpi}
                                         )

most_popular_items_summary.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50

In [58]:
#Sort
mpi_desc = most_popular_items_summary.sort_values(["Purchase Count"], ascending=False).head()
mpi_desc

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [59]:
#Clean
mpi_desc.style.format(
                        {"Item Price":"${:,.2f}",
                         "Total Purchase Value":"${:,.2f}"})

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [60]:
#Sort
mpi_desc  = most_popular_items_summary.sort_values(["Total Purchase Value"],ascending=False).head()
mpi_desc

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [61]:
#Clean
mpi_desc.style.format({"Item Price":"${:,.2f}",
                                "Total Purchase Value":"${:,.2f}"})